In [2]:
import pandas as pd
import numpy as np

In [1]:
dataset={
    'Name':['Ayasha','Riya','Nitu','Mina'],
    'RollNo':[1,2,3,4],
    'Marks':[99,90,80,50],
}

In [3]:
df=pd.DataFrame(dataset)

In [4]:
df

     Name  RollNo  Marks
0  Ayasha       1     99
1    Riya       2     90
2    Nitu       3     80
3    Mina       4     50

In [7]:
print("Enter the option 1. Mean 2. Median 3.Mode 4.std")
x=input()
if x=='1':
    print(df.mean)
elif x=='2':
    print(df.median)
elif x=='3':
    print(df.mode)
else:
    print(df.std)

Enter the option 1. Mean 2. Median 3.Mode 4.std
<bound method NDFrame._add_numeric_operations.<locals>.std of      Name  RollNo  Marks
0  Ayasha       1     99
1    Riya       2     90
2    Nitu       3     80
3    Mina       4     50>

In [8]:
df.isnull()

    Name  RollNo  Marks
0  False   False  False
1  False   False  False
2  False   False  False
3  False   False  False

In [9]:
df.interpolate()

     Name  RollNo  Marks
0  Ayasha       1     99
1    Riya       2     90
2    Nitu       3     80
3    Mina       4     50

In [12]:
df.fillna

<bound method DataFrame.fillna of      Name  RollNo  Marks
0  Ayasha       1     99
1    Riya       2     90
2    Nitu       3     80
3    Mina       4     50>

In [22]:
print (df['Marks']>=80)

0     True
1     True
2     True
3    False
Name: Marks, dtype: bool

In [24]:
df[(df['Marks']>=80) & (df['RollNo']>=0)]

     Name  RollNo  Marks
0  Ayasha       1     99
1    Riya       2     90
2    Nitu       3     80

In [28]:
df=df.rename(columns={'Name':'StudName'})

In [29]:
df

  StudName  RollNo  Marks
0   Ayasha       1     99
1     Riya       2     90
2     Nitu       3     80
3     Mina       4     50

In [30]:
df.replace(50,70)

  StudName  RollNo  Marks
0   Ayasha       1     99
1     Riya       2     90
2     Nitu       3     80
3     Mina       4     70